const Map locs = {
  "UZ": {
    "one": "Tokio, Yaponiya",
    "three": "Berlin, Germaniya",
    "two": "Melburn, Avstraliya",
    "five": "Okland, Yangi Zellandiya",
    "four": "Kataloniya, Ispaniya",
    "eight": "Meksika",
    "six": "Vankover, Kanada",
    "ten": "Rotterdam, Niderlandiya",
    "seven": "Kanberra, Avstraliya",
    "twelve": "Blekpul, Buyuk Britaniya",
    "nine": "Vena",
    "fifteen": "Monreal, Kanada",
    "eleven": "Sidney, Avstraliya",
    "fourteen": "Praga, Chexiya",
    "thirteen": "Seul, Janubiy Korea",
    "sixteen": "Toshkent, O'zbekiston",
    "seventeen": "New York, AQSH",
    "eighteen": "Moskva, Rossiya",
    "nineteen": "Tianjin, Xitoy",
    "twenty": "Kanada, Toronto",
    "twentyone": "Pekin, Xitoy",
    "twentytwo": "Chikago, AQSH",
    "twentythree": "Shanxay, Xitoy",
    "twentyfour": "Kuala Lumpur, Malayziya"
  },
  "RU": {
    "one": "Япония, Токио",
    "three": "Берлин, Германия",
    "two": "Мельбурн, Австралия",
    "five": "Окленд, Новая Зеландия",
    "four": "Испания, Каталония",
    "eight": "Мексика",
    "six": "Ванковер, Канада",
    "ten": "Роттердам, Нидерландия",
    "seven": "Канберра, Австралия",
    "twelve": "Блэкпуль, Великобритания",
    "nine": "Вена",
    "fifteen": "Монреаль, Канада",
    "eleven": "Сидней, Австралия",
    "fourteen": "Прага, Чехия",
    "thirteen": "	Южная Корея, Сеул",
    "sixteen": "Ташкентская, Узбекистан",
    "seventeen": "Нью-Йорк, США",
    "eighteen": "Россия, Москва",
    "nineteen": "Тяньцзинь, Китай",
    "twenty": "Канада, Торонто",
    "twentyone": "Пекин, Китай",
    "twentytwo": "Чикаго, США",
    "twentythree": "КНР, Шанхай",
    "twentyfour": "Малайзия, Куала-Лумпур"
  },
  "US": {
    "one": "Tokyo, Japan",
    "three": "Berlin, Germany",
    "two": "Melbourne, Australia",
    "five": "Auckland, New Zealand",
    "four": "Catalonia, Spain",
    "eight": "Mexico",
    "six": "Vancouver, Canada",
    "ten": "Rotterdam, Netherlands",
    "seven": "Canberra, Australia",
    "twelve": "Blackpool, England",
    "nine": "Vienna",
    "fifteen": "Montreal, Canada",
    "eleven": "Sydney, Australia",
    "fourteen": "Prague, Czech",
    "thirteen": "South Korea, Seoul",
    "sixteen": "Tashkent, Uzbekistan",
    "seventeen": "New York, USA",
    "eighteen": "Moscow, Russia",
    "nineteen": "Tianjin, China",
    "twenty": "Canada , Toronto",
    "twentyone": "Pekin, China",
    "twentytwo": "Chicago, USA",
    "twentythree": "PRC, Shanghai",
    "twentyfour": "Malaysia, Kuala Lumpur"
  }
};

const Map names = {
  "UZ": {
    "one": "Tokyo teleminorasi",
    "three": "Berlin teleminorasi",
    "two": "Rialto minorasi",
    "five": "Sky-tower",
    "four": "Kolserola teleminorasi",
    "eight": "Meksika teleminorasi",
    "six": "Xarbor teleminorasi",
    "ten": "Roterdam",
    "seven": "Telstra minorasi",
    "twelve": "Blekpul minorasi",
    "nine": "Vensk (Dunay) teleminorasi",
    "fifteen": "Monreal olimp stadioni",
    "eleven": "Sidney teleminorasi",
    "fourteen": "Praga teleminorasi",
    "thirteen": "Seul teleminorasi",
    "sixteen": "Toshkent teleminorasi",
    "seventeen": "Empire State Building",
    "eighteen": "Ostankino minorasi",
    "nineteen": "Tianjin radio va teleminorasi",
    "twenty": "CN minorasi",
    "twentyone": "Olympic minorasi",
    "twentytwo": "Chikago minorasi",
    "twentythree": "Sharq Gavhari",
    "twentyfour": "Kuala Lumpur minorasi"
  },
  "RU": {
    "one": "Телебашня Токио",
    "three": "Телебашня Берлин",
    "two": "Башни Риальто",
    "five": "Скай-тауэр",
    "four": "Телебашня Кольсерола",
    "eight": "Телебашня Мексика",
    "six": "Харбор Телебашня",
    "ten": "Роттердам",
    "seven": "Башня Телстра",
    "twelve": "Блэкпульская башня",
    "nine": "Дунайская башня",
    "fifteen": "Олимп стадион (Монреаль)",
    "eleven": "Сиднейская телебашня",
    "fourteen": "Телебашня (Прага)",
    "thirteen": "Сеульская телебашня",
    "sixteen": "Ташкентская телебашня",
    "seventeen": "Эмпайр Стейт Билдинг",
    "eighteen": "Останкинская телебашня",
    "nineteen": "Тяньцзиньская радио и телебашня",
    "twenty": "Си-Эн Тауэр",
    "twentyone": "Олимпийская башня в Пекине",
    "twentytwo": "Чикаго Спайр",
    "twentythree": "Восточная жемчужина",
    "twentyfour": "Куала-Лумпурская башня"
  },
  "US": {
    "one": "Tokyo Tower",
    "three": "Berlin TV Tower",
    "two": "Tower Rialto",
    "five": "Sky-Tower",
    "four": "Collserola TV Tower",
    "eight": " Mexico TV Tower ",
    "six": "Harbour skyscraper",
    "ten": "Rotterdam",
    "seven": "Telstra Tower",
    "twelve": "Blackpool Tower",
    "nine": "The Danube Tower",
    "fifteen": "Olympic Stadium (Montreal)",
    "eleven": "Sydney TV Tower",
    "fourteen": "TV Tower (Prague)",
    "thirteen": "Seoul TV Tower",
    "sixteen": "Tashkent TV tower",
    "seventeen": "Empire State Building",
    "eighteen": "Ostankino Tower",
    "nineteen": "Tianjin Radio and Television Tower",
    "twenty": "CN Tower",
    "twentyone": "Beijing Olympic Tower",
    "twentytwo": "Chicago Spire",
    "twentythree": "Oriental pearl",
    "twentyfour": "Kuala Lumpur Tower"
  }
};

const Map infos = {
  "RU": {
    "one": '''Телевизионная башня Токио (Япония, Токио, Минато, Сиба-коэн)
Строительство: 1957-1958
Высота: 332,6 м
Архитектор: Татю Найто
Владелец: Нихон Дэмпато (Nippon Television City Corp.)
Интересные факты
Расположена Tokyo Tower в городе Минато (или один из специальных районов Токио). Ныне с нее осуществляют вещание 15 компаний. Трансляции ведутся как теле- , так и радиоформата. Первоначально башня возводилась, как техническое сооружение. Ее основная функция – удержание антенн. Однако объект сразу вызвал интерес у горожан и гостей Токио. Было принято решение использовать его для привлечения и развлечения туристов.
Здесь создано две обсерватории: на высоте 150 и 250 метров. Туристы поднимаются на площадки при помощи мощных лифтов. Всего их четыре. Мощность – 2880 человек в час. Лифты двигаются со скоростью 9 км/ч. С нижней площадки зрителю открывается вид радиусом 100 км, с верхней можно обозреть 200 км.
Несмотря на то что телебашня изначально конструировалась с учетом сейсмоопасности региона, ее шпиль не выдержал нагрузки. Он был поврежден в 2011 году во время землетрясения Тохоку. Конструкция создана так, что может под порывами урагана смещаться на 0,3 м без потерь. Но Великое восточно-японское землетрясение, магнитуда которого достигала на пике 9,1 балла, оказалось сильнее.
Несмотря на то что телебашня изначально конструировалась с учетом сейсмоопасности региона, ее шпиль не выдержал нагрузки. Он был поврежден в 2011 году во время землетрясения Тохоку. Конструкция создана так, что может под порывами урагана смещаться на 0,3 м без потерь. Но Великое восточно-японское землетрясение, магнитуда которого достигала на пике 9,1 балла, оказалось сильнее.
Tokyo Tower пострадала не от землетрясения, а из-за развития технологий. Для трансляции аналогового вещания ее высоты оказалось мало. В 2012 году построили новую, 634-метровую телебашню Tokyo Skytree. В старой башне остались компании, занимающиеся радиовещанием, сохранилась ее туристическая привлекательность.
Еще в 1989 году Tokyo Tower оснастили 176 мощными прожекторами. Их используют в ходе шоу для привлечения отдыхающих, а также для подсветки самой конструкции. К примеру, на Рождество на башне загораются цифры нового года. В некоторые особенные даты ее освещение меняется. Так, 01.10.2000г. начался месяц борьбы с раком молочной железы. В ознаменование этой даты башня засияла розовым цветом и теперь ежегодно 1 октября башня окрашивается в розовый цвет.
Несмотря на появление в регионе более удобной конструкции, Tokyo Tower остается символом Токио. Ее стилизованное изображение часто используется в аниме и манга, японских фильмах ужасов (кайдзю). У башни есть талисманы-близнецы. Это гуманоиды, одетые в комбинезоны разных цветов (красный и синий). Обоих зовут Ноппон. Талисманы появились или «родились» к сорокалетнему юбилею башни.
''',
    "two": '''Башня Риалто, Rialto Towers (Мельбурн, Австралия)
Строительство: 1982 — 1986
Высота: 270 метров
Архитектор: Gerard de Preu and Partners
Perrott Lyon Mathieson
Проект здания был разработан архитектурной компанией «Gerar de Rreu and Partners» совместно с «Perrott Lyon Mathieson». Строительство здания проходило с 1982 по 1986 год. Официальное открытие состоялось в октябре 1986 года. Название здания перешло к нему от исторического комплекса, располагающегося по соседству.
Интересные факты
Фактически объект, носящий название Риалто-Тауэрс, представляет собой комплекс из двух зданий, расположенных в непосредственной близости друг к другу. Высота южной башни составляет 251 метра, 63 этажа и 3 подземных этажа. Высота северной башни — 185 метров и 43 этажа. Общая площадь офисных помещений — 84000 м².
Строительство зданий ещё не было завершено, когда первые постояльцы начали занимать нижние этажи в 1984 году. 19 июля 1994 года была открыта Мельбурнская площадка обозрения, которая располагается на 55 этаже южной башни на высоте 234 метра. В хорошую погоду отсюда открывается вид на расстояние до 60 километров. Кроме двух скоростных лифтов на площадку обозрения ведёт лестница состоящая из 1450 ступеней. Здесь проводится ежегодная Гонка по ступеням.
В 2009 году в связи с утратой лидирующего положения самой высокой смотровой площадки Мельбурна смотровая площадка была закрыта. В 2011 году на месте бывшей смотровой площадки был открыт ресторан Vue De Monde.
На момент завершения строительства комплекс зданий занимал 23-е место в списке самых высоких зданий в мире и был вторым по высоте зданием за пределами США. По состоянию на октябрь 2008 года комплекс является 6-м по высоте в Австралии и 122-м в мире.
''',
    "three":
        '''Первоначальная общая высота башни составляла 365 метров (1198 футов), но после установки новой антенны в 1997 году она выросла до 368 метров (1207 футов). 
Fernsehturm является четвертым по высоте отдельно стоящим сооружением в Европе. , после Москвы «ю.ш. Останкинской башни , в Киеве телебашни и Рижской радио и телевизионной башни . Сфера представляет собой платформу для посетителей и вращающийся ресторан.в середине сферы. Платформа для посетителей, также называемая панорамным полом, находится на высоте около 203 метров (666 футов) над землей, а видимость может достигать 42 километров (26 миль) в ясный день. Ресторан Telecafé, который меняется каждые 30 минут, находится в нескольких метрах над платформой для посетителей на высоте 207 метров (679 футов).
При первом построении он поворачивался один раз в час; Скорость была позже увеличена вдвое после ремонта башни в 1997 году.
Два лифта доставляют посетителей в сферу башни за 40 секунд. Также имеется лестница с 986 ступенями.''',
    "four":
        '''Торре де Коллсерола ( каталонское произношение:  [ˈtorə ðə kuʎsəˈɾɔlə] ) - это башня с уникальным дизайном, расположенная на холме Тибидабо в Серра-де-Коллсерола в Барселоне , Каталония , Испания . Его спроектировали архитектор сэр Норман Фостер и испанские инженеры-строители Хулио Мартинес Кальсон и Мануэль Хулиа Виларделл. Эта символическая башня была построена в 1991 году строительной компанией Cubiertas y MZOV SA для летних Олимпийских игр 1992 года . Как и во многих башнях, он имеет отсек для размещения на полу, но использует растяжку.для боковой поддержки типа мачты. Этот футуристический дизайн, который в основном используется в качестве теле- и радиопередатчика, обеспечивает самую высокую точку обзора на город. Верхняя антенна достигает 288,4 м (946 футов), а верхняя часть тринадцатиэтажной капсулы достигает 152 м (499 футов). Самая высокая точка этой башни - это самое высокое место в Барселоне. Десятый этаж капсулы открыт для публики.''',
    "five":
        '''Sky Tower является телекоммуникационной и смотровой башней в Окленде , Новая Зеландия. Расположенный на углу улиц Виктория и Федерал в центральном деловом районе города , он имеет высоту 328 метров (1076 футов) при измерении от уровня земли до вершины мачты , что делает его самым высоким отдельно стоящим сооружением в Южном полушарии и 27-я по высоте башня в мире . Благодаря своей высоте и уникальному дизайну он стал культовой достопримечательностью Окленда.
Башня является частью комплекса казино SkyCity Auckland , первоначально построенного в 1994–1997 годах для Harrah's Entertainment . Несколько верхних уровней доступны для публики, привлекая в среднем 1 150 посетителей в день (более 415 000 в год)''',
    "six":
        '''Харбор - центр небоскреб в центральном деловом районе в центре Ванкувера , Британская Колумбия , Канада , который был открыт в 1977 году . Смотровая башня на вершине офисного здания делает его одним из самых высоких сооружений Ванкувера и заметной достопримечательностью на горизонте города. Со своей обзорной площадкой на 360 градусов он также служит туристической достопримечательностью с вращающимся рестораном Top of Vancouver , откуда открывается физически беспрепятственный вид на город.
Harbour Center расположен по адресу 555 West Hastings Street в центре Ванкувера . Он находится в нескольких шагах от станции Waterfront , крупного мультимодального транзитного узла, который служит терминалом в центре Ванкувера для различных операций TransLink, включая SeaBus , West Coast Express , SkyTrain , Canada Line и автобусы. Университет Саймона Фрейзера управляет своим кампусом в центре города, в прилегающем здании Спенсера, и в нем находится Центр диалога и мира Канады.''',
    "seven":
        '''Telstra Tower (также известная как Black Mountain Tower и ранее Telecom Tower ) - это телекоммуникационная башня и смотровая площадка, расположенная над вершиной Черной горы в столице Австралии Канберре . Он назван в честь крупнейшей телекоммуникационной компании Австралии Telstra Corporation , которая владеет и управляет башней. Возвышаясь на 195,2 метра (640 футов) над вершиной горы, он является достопримечательностью Канберры и предлагает панорамный вид на город и его окрестности с крытой смотровой площадки и двух открытых смотровых площадок.''',
    "eight":
        '''Torre Латиноамериканский (Английский: Латиноамериканский башня ) является небоскреб в центре Мехико , расположенный в историческом центре города . Его центральное расположение, высота (166 м (545 футов)) и история делают его одной из самых важных достопримечательностей города. Он широко признан во всем мире как инженерная и архитектурная достопримечательность, так как это был первый в мире крупный небоскреб, успешно построенный в высокоактивной сейсмической зоне. Небоскреб, в частности, без повреждений выдержал землетрясение магнитудой 8,1 в Мехико в 1985 г. в то время как несколько других построек в центре города были повреждены.
Torre Latinoamericana был самым высоким построенным зданием Мексики в течение почти 27 лет с момента его открытия в 1956 году до 1982 года, когда было завершено строительство Torre Ejecutiva Pemex высотой 214 м (702 фута) . Хотя структура отеля Hotel de México (теперь известного как ЦМТ Мехико ) уже превзошла его десятью годами ранее, строительство не будет завершено до 1994 года.''',
    "nine":
        '''Donauturm (английский: Дунайская башня ) башня в Вене , то самым высоким сооружением в Австрии на 252 метров (827 футов), и является 59 - й самая высокая башня в мире . Открытая в апреле 1964 года, башня расположена недалеко от северного берега реки Дунай в районе Донауштадт . На заднем плане видны холмы Леопольдсберг и Каленберг .
Donauturm была построена в 1962–1964 годах по проекту архитектора Ханнеса Линтля в рамках подготовки к Венской международной выставке садоводства 1964 года. Высота башни составляет 252 метра (827 футов). Закладка первого камня состоялась 12 октября 1962 года. После 18 месяцев строительства под руководством Эберхарда Фёдиша башня была официально открыта 16 апреля 1964 года федеральным президентом Адольфом Шерфом .''',
    "ten":
        '''Евромачта - смотровая башня в Роттердаме , Нидерланды , спроектированная Хью Мааскантом, построенная между 1958 и 1960 годами. Она была построена специально для Флориады 1960 года и является памятником архитектуры с 2010 года. Башня представляет собой бетонную конструкцию с внутренним диаметром. 9 м (30 футов) и толщиной стены 30 см (12 дюймов). Для устойчивости он построен на бетонном блоке массой 1 900 000 кг (4 200 000 фунтов), так что центр тяжести находится под землей. Здесь есть смотровая площадка "воронье гнездо" на высоте 96 м (315 футов) над землей и ресторан. Первоначально высотой 101 м (331 фут) это было самое высокое здание в Роттердаме. Он уступил это место высотному зданию Erasmus MC (113,5 м, 372 фута), которое было завершено в 1968 году, но восстановило его, когда космическая башня была добавлена ​​к вершине здания в 1970 году, что дало дополнительные 85 зданий. м (279 футов). Евромачта - самое высокое здание в Нидерландах, она также является членом Всемирной федерации великих башен . В 2008 и 2009 годах в башне проходило мероприятие по экстремальным видам спорта, на котором БЕЙС-прыжки .''',
    "eleven":
        '''Сиднейская башня - самое высокое сооружение Сиднея и вторая по высоте смотровая башня в Южном полушарии . Название Сиднейская башня стало обычным явлением в повседневной жизни; однако башня была известна как Sydney Tower Eye , AMP Tower , Flower Tower , Glower Tower , Westfield Centrepoint Tower , Big Poke , Centrepoint Tower или просто Centrepoint .
Сиднейская башня является членом Всемирной федерации великих башен.
Башня возвышается на 309 м (1014 футов) над центральным деловым районом Сиднея (CBD), расположенным на Маркет-стрит, между улицами Питт и Каслри. До него можно добраться из торгового центра Pitt Street Mall , Market Street или Castlereagh Street. Он находится над торговым центром Westfield Sydney (ранее Centrepoint). Башня открыта для публики и является одной из самых известных туристических достопримечательностей города, ее можно увидеть с различных точек зрения по всему городу и из прилегающих пригородов. Оклендская Скай Тауэр выше, но главная смотровая площадка Сиднейской башни почти на 30 м (98 футов) выше, чем смотровая площадка на Оклендской Скай Тауэр''',
    "twelve":
        '''Блэкпульская башня - это туристическая достопримечательность в Блэкпуле , Ланкашир , Англия, которая была открыта для публики 14 мая 1894 года. Когда она открылась, Блэкпульская башня была самым высоким искусственным сооружением в Британской империи . Вдохновленный Эйфелевой башней в Париже, она имеет высоту 518 футов (158 метров) и является 125-й по высоте отдельно стоящей башней в мире. Блэкпульская башня также является общим названием Tower Buildings, развлекательного комплекса в трехэтажном блоке из красного кирпича, который включает в себя башню, Tower Circus, бальный зал Tower и сады на крыше, который был внесен в список Grade I. здание 1973 г. В мае 2019 года башне исполнилось 125 лет.''',
    "thirteen":
        '''Башня Намсам, построенная в 1969 году и обойденная примерно в 2,5 миллиона долларов, была открыта для публики в 1980 году. Сеульская башня была завершена 3 декабря 1971 года по проекту архитекторов из Джангджонгрюля, хотя в то время интерьер здания не был меблирован. До августа 1975 года потребовалось построить третий этаж смотровой площадки, музей, открытый зал, сувенирный магазин и другие объекты до 15 октября 1980 года. С тех пор башня стала визитной карточкой Сеула. Высота башни колеблется от 236,7 м (777 футов) у основания до 479,7 м (1574 футов) над уровнем моря. В 2005 году Сеульская башня была переименована в Сеульскую башню N, тогда как буква «N» означает «новый», «Намсан» и «природа». Приблизительно 15 миллиардов вон было потрачено на ремонт и реконструкцию башни.''',
    "fourteen":
        '''Жижков телебашня ( Чехия : Žižkovský vysílač ) представляет собой уникальный передатчик башня , построенная в Праге в период с 1985 по 1992 год по проекту архитектора Ваклав Оликки и структурного инженера Иржи Kozák, он стоит высоко над традиционной горизонт города от своей позиции на вершине холма в районе Жижков , в честь которого он и получил свое название. Башня - образец архитектуры хай-тек.
Высота башни 216 метров (709 футов), высота обсерватории 93 м, высота гостиничных номеров 70 м, высота ресторанов 66 м, вместимость 180 человек. Три лифта перевозят пассажиров со скоростью 4  м / с . ''',
    "fifteen":
        '''Олимпийский стадион ( французский : Stade olympique ) - многоцелевой стадион в Монреале, Канада , расположенный в Олимпийском парке в районе Хочелага-Мезоннев города. Построенное в середине 1970-х года в качестве основного места для летних Олимпийских игр 1976 , он по прозвищу «The Big O», ссылка на оба его имени и в пончике шейп постоянной составляющей крыши стадиона. Башня, стоящая рядом со стадионом, Монреальская башня, является самой высокой наклонной башней в мире с углом подъема 45 градусов. Его также называют «Большой долг», чтобы отсылать к астрономической стоимости стадиона и Олимпийских игр 1976 года в целом.
Стадион - самый большой по вместимости в Канаде. После Олимпийских игр был установлен искусственный газон, который стал домом для профессиональных бейсбольных и футбольных команд Монреаля . Монреальский Alouettes из CFL вернулся к прежнему дому Мольсон стадиона в 1998 году на игры регулярного сезона, но продолжал использовать Олимпийский стадион для плея - офф и Кубок Грого игра до 2014 года , когда они вернулись в Molson стадион для всех своих игр. После бейсбольного сезона 2004 года выставочные центры Expos переехали в Вашингтон, округ Колумбия, и сталиВашингтон Нэшнлз . В настоящее время стадион служит многоцелевым объектом для проведения специальных мероприятий (например, концертов, выставок) с постоянной вместимостью 56 040 человек.''',
    "sixteen":
        '''Ташкент телебашня ( Узбекская : Тошкент Teleminorasi ) является 375-метровый (1230 футов) башня, расположенная в Ташкенте , Узбекистан и 12 -самая высокая башня в мире. Строительство началось в 1978 году, а эксплуатация началась 6 лет спустя, 15 января 1985 года. С 1985 по 1991 год это была 4-я по высоте башня в мире. Более того, решение о строительстве Ташкентской башни или телебашни Узбекистана было принято в 1971 году в 1 сентября с целью распространения теле- и радиосигналов на весь Узбекистан. Он имеет вертикальную консольную конструкцию и изготовлен из стали. Его архитектурный дизайн - продукт фирмы Terxiev, Tsarucov & Semashko.
На башне есть смотровая площадка, расположенная на высоте 97 метров (318 футов) над землей. Это второе по высоте сооружение в Центральной Азии после Экибастузской ГРЭС-2 в Экибастузе, Казахстан. Он также принадлежит к Всемирной федерации великих башен .
Основными целями башни являются радио и телевидение -transmission. Сигнал достигает самых дальних точек Ташкентской области и некоторых южных регионов Казахстана. Башня также используется для связи между правительственными ведомствами и организациями. Башня также служит комплексной гидрометеорологической станцией.''',
    "seventeen":
        '''Empire State Building является 102-история Art Deco небоскреб в центре Манхэттена в Нью - Йорке , США. Он был спроектирован Shreve, Lamb & Harmon и построен с 1930 по 1931 год. Его название происходит от « Эмпайр-стейт », прозвища штата Нью-Йорк . Здание имеет высоту крыши 1250 футов (380 м) и общую высоту 1454 футов (443,2 м), включая антенну. Эмпайр-стейт-билдинг оставался самым высоким зданием в мире до постройки Всемирного торгового центра в 1970 году; после его краха в 2001 г.Эмпайр Стейт Билдинг был снова самым высоким небоскребом города до 2012 года По состоянию на 2020 г. , здание является седьмым по высоте здания в Нью - Йорке , то девятый по высоте завершен небоскреб в Соединенных Штатах , то сорок восьмой по высоте в мире , и пятое по высоте отдельно стоящее строение в Америке .
На территории Эмпайр-стейт-билдинг в Южном Мидтауне на западной стороне Пятой авеню между 33-й и 34- й Западными улицами в 1893 году был построен отель Waldorf-Astoria . В 1929 году компания Empire State Inc. приобрела участок и разработала там план небоскреба. Дизайн Эмпайр-стейт-билдинг меняли пятнадцать раз, пока он не стал самым высоким зданием в мире. Строительство началось 17 марта 1930 года, и здание открылось через тринадцать с половиной месяцев спустя, 1 мая 1931 года. Несмотря на благоприятную рекламу, связанную со строительством здания, из-за Великой депрессии и Второй мировой войны, его владельцы не получали прибыли до начала 1950-х годов.''',
    "eighteen":
        '''Останкинская башня ( русский : Останкинская телебашня , Останкинская telebashnya ) является телевидение и радио башня в Москве , России , принадлежит Московского филиала унитарного предприятия российской телерадиовещательной сети . Останкино высотой 540,1 метра (1772 фута) спроектировал Николай Никитин . В настоящее время это самое высокое отдельно стоящее сооружение в Европе и 11-е место в мире.. Между 1967 и 1974 годами он был самым высоким в мире. Башня была первым отдельно стоящим сооружением, высота которого превышала 500 м (1600 футов). Останкино построили к 50-летию Октябрьской революции . Он назван в честь окрестностей Останкинского района Москвы.
Строительство началось в 1963 году и было завершено в 1967 году. Широкое использование предварительно напряженного бетона привело к созданию простой и прочной конструкции . Он превзошел Эмпайр-стейт-билдинг и стал самым высоким отдельно стоящим строением в мире . Он удерживал этот рекорд в течение восьми лет, пока в 1975 году его не обогнала башня Си-Эн Тауэр в Канаде, которая превысила его высоту на 13 метров (43 фута). Останкинская башня оставалась вторым по высоте отдельно стоящим сооружением в мире еще 32 года, до небоскреба Бурдж-Халифа. превзошла по высоте и ее, и Си-Эн Тауэр в 2007 году. Останкинская башня более 50 лет остается самым высоким сооружением в Европе.
План 1994 года по увеличению высоты башни до 561 метра (1841 фут) за счет добавления антенны не был реализован из-за отсутствия финансирования.''',
    "nineteen":
        '''Тяньцзиньская телебашня является 415,2 метров (футов тысячу триста шестьдесят два) -tall башни в Тяньцзине , Китай используется в основном для связи. Это восьмая по высоте отдельно стоящая башня в мире . Он был построен в 1991 году и обошелся в 45 миллионов долларов. Примерно две трети пути вверх по башне - это смотровая площадка площадью 253 квадратных метра (2720 квадратных футов) (используется в основном для оборудования связи). Он является членом Всемирной федерации великих башен .''',
    "twenty":
        '''CN Tower ( французский : Tour CN ) составляет 553,3 м высоты (1,815.3 футов) а конкретные связей и наблюдения башни расположена в центре города Торонто , Онтарио , Канада. [3] [8] Построенный на территории бывшего железнодорожного вокзала , он был завершен в 1976 году. Его название «CN» первоначально относилось к Canadian National , железнодорожной компании, построившей башню. После решения железной дороги о продаже непрофильных грузовых железнодорожных активов до приватизации компании в 1995 году она передала вышку компании Canada Lands Company., федеральная коронная корпорация, отвечающая за развитие недвижимости.
Си-Эн Тауэр удерживала рекорд самой высокой отдельно стоящей конструкции в мире в течение 32 лет до 2007 года, когда ее превзошла Бурдж-Халифа , и была самой высокой башней в мире до 2009 года, когда ее превзошла Кантонская башня. Сейчас это девятое по высоте отдельно стоящее строение в мире и остается самым высоким отдельно стоящим сооружением на суше в Западном полушарии . В 1995 году CN Tower был признан одним из современных Семи чудес света со стороны Американского общества гражданских инженеров . Он также принадлежит к Всемирной федерации великих башен.
Это значок подписи Торонто горизонта и привлекает более двух миллионов иностранных туристов ежегодно''',
    "twentyone":
        '''Beijing Olympic Tower ( китайский :北京奥林匹克塔; пиньинь : ПЕКИН Àolínpǐkè Tǎ ) расположен на Kehui South Road, часть Olympic Green в районе Чаоян в Пекине , Китай. Строительство началось в 2011 году, через три года после летних Олимпийских игр 2008 года ; он был завершен в 2014 году и открыт 8 августа 2015 года. Он используется исключительно для наблюдения; не предусмотрены офисы или квартиры. Дизайн был разработан китайской фирмой China Architecture Design & Research Group ; а ШэньчжэньАрхитектор утверждал, что архитекторы фирмы списали его ранее отмеченный наградами дизайн.
При высоте 258 метров (846 футов) это вторая по высоте башня в городе после Центральной радио- и телебашни и четвертое по высоте строение в городе . Его дизайн с четырьмя меньшими круглыми этажами на разной высоте и расположением под большим верхним этажом призван перекликаться с олимпийскими кольцами . Общий дизайн был вдохновлен травинками; однако его также сравнивают с «огромными гвоздями».''',
    "twentytwo":
        '''Chicago Spire был небоскреб проект в Чикаго , который был частично построен в период между 2007 и 2008 до их аннулирования. Расположенный на 400 Н. Лейк-Шор Драйв , он имел бы высоту 2 000 футов (610 м) и 150 этажей и был бы самым высоким зданием в Западном полушарии. Первоначально проект был предложен в качестве Фордхэмского шпиля в июле 2005 года. Он состоял из 116 этажей, включая гостиницу и кондоминиумы, а наверху была мачта радиовещательной антенны. Здание было спроектировано и возглавлено испанским инженером-архитектором Сантьяго Калатрава и разработчиком из Чикаго Кристофером Т. Карли из Fordham Company . 16 марта 2006 г.Комиссия по планированию Чикаго единогласно одобрила первоначальный проект здания. 4 ноября 2014 года постановлением суда было завершено рассмотрение первоначального плана развития и расширенного судебного разбирательства по проекту девятилетней давности. Разработчик Гаррет Келлехер подписал договор о местонахождении собственности с крупнейшим кредитором проекта, Related Midwest, который объявил, что не будет строить Шпиль, и опубликовал свои планы относительно этого участка ''',
    "twentythree":
        '''Oriental Pearl Radio & Television Tower ( упрощенный китайский :东方明珠塔; традиционный китайский :東方明珠塔; пиньинь : DONGFANG Míngzhūtǎ ; Shanghainese : Tonfon Mintsyta , официальное название:东方明珠广播电视塔) является телевизионная башня в Шанхае . Он расположен на оконечности Луцзяцзуй в Новом районе Пудун на берегу реки Хуанпу , напротив набережной Бунд., делает его отличительным ориентиром в этом районе. Его главными дизайнерами были Цзян Хуан Чен, Линь Бенлинь и Чжан Сюлинь. Строительство началось в 1991 году, а завершили башню в 1995 году.
При высоте 468 м (1536 футов) это было самое высокое сооружение в Китае с 1994 по 2007 год, когда его превзошел Шанхайский всемирный финансовый центр . Он классифицируется как AAAAA живописной местности по Китайской национальной туристской администрации . Ночью башня ярко освещена различными светодиодами . 7 июля 2007 года в Башне «Восточная жемчужина» прошел китайский концерт «Живая Земля» .
В башне есть 11 сфер, больших и малых. Две самые большие сферы по длине башни имеют диаметр 50 м (164 футов) для нижней и 45 м (148 футов) для верхней. Они связаны тремя колоннами, каждая диаметром 9 м (30 футов). Самая высокая сфера имеет диаметр 14 м (46 футов).
Вся башня поддерживается тремя огромными колоннами, которые начинаются под землей.''',
    "twentyfour":
        '''Башня Куала-Лумпур ( Башня KL ; малайский : Menara Kuala Lumpur ) - башня связи, расположенная в Куала-Лумпуре , Малайзия . Ее строительство было завершено 1 марта 1995 года. Она имеет антенну , увеличивающую ее высоту до 421 метра (1381 фут), и является седьмой по высоте отдельно стоящей башней в мире . Высота крыши капсулы составляет 335 метров (1099 футов). В остальной части башни внизу есть лестница и лифт, чтобы добраться до верхней части, где также находится вращающийся ресторан , откуда посетителям открывается панорамный вид на город.
Ежегодно проводятся забеги, участники которых забегают по лестнице на вершину. Башня также выступает в качестве исламского фалак обсерватории для наблюдения за серп , который отмечает начало мусульманского месяца в рамадан , Syawal и Zulhijjah , чтобы отпраздновать месяц поста в рамадан , Хари Райя Aidilfitri и Aidiladha . Башня - самая высокая смотровая площадка Куала-Лумпура, открытая для публики.''',
  },
  "UZ": {
    "one":
        '''Tokio minorasi (東京タワー, Tōkyō tawā , rasmiy ravishda 日本電波塔 Nippon denpatō " Yaponiya radio minorasi "deb nomlanadi) - Yaponiya , Tokio , Minato, Shiba-koen tumanidagi aloqa va kuzatuv minorasi . 
332,9 metr (1,092 fut) balandlikda, bu Yaponiyadagi eng baland binolar orasida ikkinchi o'rinda turadi . Ushbu tuzilish Eyfel minorasi tomonidan ilhomlangan panjara minorasi bo'lib, havo oqimi qoidalariga rioya qilish uchun oq va xalqaro to'q sariq rangga bo'yalgan .
1958 yilda qurilgan minora asosiy daromad manbai turizm va antenna lizingidir. Minorani 150 milliondan ortiq kishi ziyorat qildi. To'g'ridan-to'g'ri minora ostidagi to'rt qavatli bino bo'lgan FootTown muzeylar, restoranlar va do'konlarni o'z ichiga oladi. U erdan jo'nab ketish uchun mehmonlar ikkita kuzatuv maydonchasiga tashrif buyurishlari mumkin. 
Ikki qavatli Main Deck (ilgari Asosiy Observatoriya deb nomlangan) 150 metr (490 fut), kichikroq Top Deck (ilgari "Maxsus Observatoriya" nomi bilan tanilgan) balandligi 249,6 metr (819 fut) ga etadi. Ismlar 2018 yilda yuqori kemaning yangilanishidan so'ng o'zgartirildi.''',
    "two": '''Rialto minorasi, Rialto minoralari (Melburn, Avstraliya)
Qurilish: 1982 - 1986 yillar
Balandligi: 270 metr
Me'mor: Jerar de Preu va Hamkorlar
Perrott lyon matematikasi
Bino Gerar de Rreu and Partners me'moriy firmasi tomonidan Perrott Lion Mathieson bilan hamkorlikda ishlab chiqilgan. Binoning qurilishi 1982 yildan 1986 yilgacha bo'lgan. Rasmiy ochilish 1986 yil oktyabr oyida bo'lib o'tdi. Binoning nomi unga qo'shni joyda joylashgan tarixiy majmuadan kelgan.''',
    "three":
        '''Minoraning asl balandligi 365 metrni (1198 fut) tashkil etgan, ammo 1997 yilda yangi antenna o'rnatilgandan so'ng u 368 metrga (1207 fut) ko'tarilgan.
Fernsehturm Evropadagi eng baland to'rtinchi bino hisoblanadi. , keyin Moskva 'p Ostankino minorasi , Kiev TV minorasi va Riga Radio va TV minorasi . Sfera - bu tashrif buyuruvchilar uchun platforma va aylanadigan restoransharning o'rtasida. Panoramali zamin deb ham ataladigan tashrif buyuruvchilar platformasi erdan taxminan 203 metr (666 fut) balandlikda joylashgan va ochiq kunda ko'rish imkoniyati 42 kilometrga etadi. Har 30 daqiqada bir marta aylanadigan "Telecafé" restorani mehmonlar platformasidan bir necha metr balandlikda, 207 metrda (679 fut). 
Birinchi qurishda soatiga bir marta aylantirildi; 1997 yilda minoraning yangilanishidan keyin tezlik ikki baravar oshirildi.
Ikki ko'taruvchi minora sohiliga tashrif buyuruvchilarni 40 soniya ichida etkazib beradi. Shuningdek, 986 pog'onali zinapoya mavjud.''',
    "four":
        '''Torre de Collserola ( Kataloniya cha:  [torə də kuʎsəɾɔlə] ) ustida joylashgan noyob mo'ljallangan minora bo'ladi Tibidabo Hill yilda Serra de Collserola yilda, Barselona , Kataloniya , Ispaniya . Uni me'mor Ser Norman Foster va ispaniyalik muhandislar Xulio Martines Kalzon va Manuel Julia Vilardelllar loyihalashtirishgan. Ushbu emblematik minora 1991 yilda Cubiertas y MZOV SA qurilish kompaniyasi tomonidan 1992 yil yozgi Olimpiya o'yinlari uchun qurilgan . Unda ko'pgina minoralar singari maydon uchun maydoncha mavjud, ammo yigitlarning simlari ishlatiladimast kabi lateral qo'llab-quvvatlash uchun. Asosan televizor va radio uzatuvchi sifatida ishlatiladigan ushbu futuristik dizayn shaharga nisbatan eng yuqori nuqtai nazarni taqdim etadi. Yuqori antenna 288,4 m (946 fut) ga, o'n uch qavatli podaning yuqori qismi esa 152 m (499 fut) ga etadi. Ushbu minoraning eng baland nuqtasi Barselona shahrida joylashgan eng baland joydir. Podkaning o'ninchi qavati hamma uchun ochiq.''',
    "five":
        '''Sky minorasi bir telekommunikatsiya va kuzatish minorasi bilan Oklend , Yangi Zelandiya. Shaharning CBD hududidagi Viktoriya va Federal ko'chalarining burchagida joylashgan bo'lib , uning balandligi 328 metrni tashkil etadi (1,076 fut), balandlikdan ustunning ustki qismigacha , bu janubiy yarim sharda eng baland mustaqil tuzilishga aylandi va dunyodagi eng baland 27-minora . Balandligi va betakror dizayni tufayli u Oklend siluetining ramziy belgisiga aylandi.
Minora SkyCity Oklend kazino kompleksining bir qismidir , dastlab 1994-1997 yillarda Harrah's Entertainment kompaniyasi uchun qurilgan . Bir necha yuqori darajalar jamoatchilik uchun ochiq, kuniga o'rtacha 1150 tashrif buyuruvchilarni jalb qiladi (yiliga 415000 dan ortiq)''',
    "six":
        '''Makoni markazi bilan gökdelenidir markaziy biznes tumanidagi ning Downtown Vancouver , British Columbia , Kanada ochildi 1977 . Ofis binosi ustida "Lookout" minora u bir qiladi , Vancouver eng baland tuzilmalari va taniqli belgilari shahar silueti ustida. 360 daraja tomosha qilish maydonchasi bilan, shuningdek , shaharning jismonan to'siqsiz ko'rinishini taklif qiluvchi Vancouver Top restoranida turistik diqqatga sazovor joy sifatida xizmat qiladi .
Harbour Center Vancouver shaharchasidagi West Hastings Street 555 da joylashgan . U turli xil TransLink operatsiyalari uchun Vankuver shahar markazidagi Vankuver terminali vazifasini bajaradigan Waterfront Station , yirik ko'p modali tranzit markazidan bir necha qadam narida, SeaBus , West Coast Express , SkyTrain , Canada Line va avtobuslarda joylashgan. Simon Freyzer universiteti o'z markazidagi Harbour Center kampusini qo'shni Spencer binosida ishlaydi va Dialogue Center va Canadas World joylashgan.''',
    "seven":
        '''Telstra minorasi (shuningdek, Qora tog 'minorasi va ilgari Telecom minorasi deb ham nomlanadi ) - bu Avstraliyaning poytaxti Kanberradagi Qora tog' cho'qqisidan yuqorida joylashgan telekommunikatsion minora va qarash . U minoraga egalik qiluvchi va uni boshqaradigan Avstraliyaning eng yirik telekommunikatsion kompaniyasi Telstra Corporation nomi bilan atalgan . Tog'lar cho'qqisidan 195,2 metr balandlikda ko'tarilgan bu Kanberrada diqqatga sazovor joy bo'lib, shahar va uning atrofidagi qishloqning panoramali ko'rinishini yopiq kuzatuv maydonchasi va ikkita tashqi tomosha platformasidan taqdim etadi.''',
    "eight":
        '''Torre Latinoamericana (Ingliz tili: Lotin Amerika minorasi ) bir bo'lgan osmono'par shahar Meksika Siti joylashgan, tarixiy shahar markazida . Uning markaziy joylashishi, balandligi (166 m (545 fut)) va tarixi shaharni shaharning eng muhim joylaridan biriga aylantiradi. U juda faol seysmik zonada muvaffaqiyatli qurilgan dunyodagi birinchi yirik osmono'par bino bo'lganligi sababli, u xalqaro miqyosda muhandislik va me'morchilik belgisi sifatida keng tan olingan . Osmono'par bino, ayniqsa, 1985 yil Meksiko shahridagi 8,1 balli zilzilaga zarar etkazmasdan bardosh bergan , shahar markazidagi yana bir qancha inshootlarga zarar yetgan.
Torre Latinoamericana Meksikaning qariyb 27 yil davomida qurilgan eng baland bino bo'lgan , 1956 yilda ochilganidan to 1982 yilgacha 214 m (702 fut) balandlikdagi Torre Ejecutiva Pemex qurib bitkazilgunga qadar. Mexiko Hotel (hozirda WTC Mexiko shahri deb nomlanuvchi) Hotelning tuzilishi o'n yil oldin allaqachon undan oshib ketgan bo'lsa-da, 1994 yilgacha qurib bitkazilmas edi.''',
    "nine":
        '''Donauturm (Ingliz tili: Danube minorasi ) bir minora bo'ladi Vena , Avstriya eng baland bino 252 metr (827 fut) da, va 59 bo'lgan dunyodagi eng baland minora . 1964 yil aprel oyida ochilgan minora Donaytadt tumanidagi Dunay daryosining shimoliy qirg'og'ida joylashgan . Orqa fonda Leopoldsberg va Kahlenberg tepaliklari ko'rinadi.
Donauturm 1962-1964 yillarda Vena xalqaro bog'dorchilik ko'rgazmasiga tayyorgarlik ko'rish uchun arxitektor Hannes Lintl tomonidan ishlab chiqilgan bo'lib , 1964 yilda qurilgan. Minora balandligi 252 metr (827 fut). Poydevorni buzish 1962 yil 12 oktyabrda sodir bo'lgan. Taxminan 18 oylik qurilishdan so'ng, Eberxard Fodisch rahbarligida minora 1964 yil 16 aprelda Federal Prezident Adolf Sherf tomonidan rasmiy ravishda ochilgan .''',
    "ten":
        '''Euromast - Gollandiyaning Rotterdam shahridagi kuzatuv minorasi , Xyu Maaskant tomonidan 1958 yildan 1960 yilgacha qurilgan. 1960 yil Floriade uchun maxsus qurilgan va 2010 yildan beri ro'yxatga olingan yodgorlik hisoblanadi. Minora ichki diametrli beton inshootdir. 9 m (30 fut) va devor qalinligi 30 sm (12 dyuym). Barqarorlik uchun u og'irlik markazi er ostida bo'lishi uchun 1,900,000 kg (4,200,000 funt) beton blokda qurilgan. Bu erdan 96 m (315 fut) balandlikda "qarg'a uyasi" kuzatuv maydonchasi va restoranga ega. Dastlab balandligi 101 m (331 fut) bo'lgan bu Rotterdamdagi eng baland bino edi. 1968 yilda qurilgan Erasmus MC (113,5 m, 372 fut) balandligi tufayli bu pozitsiyani yo'qotdi , ammo 1970 yilda Space Tower binoning yuqori qismiga qo'shilib, qo'shimcha 85 qo'shib, uni tikladi m (279 fut). Euromast - Gollandiyaning eng baland binosi, u shuningdek Butunjahon Buyuk minoralar federatsiyasining a'zosi . 2008 va 2009 yillarda minorada ekstremal sport musobaqasi bo'lib o'tdi.''',
    "eleven":
        '''Sidney minorasi - Sidneyning eng baland inshooti va Janubiy yarimsharda ikkinchi eng baland kuzatuv minorasi . Sidney minorasi nomi kundalik foydalanishda keng tarqalgan bo'lib qoldi; ammo, minora Sidney minorasi ko'zi , AMP minorasi , gul minorasi , Glower minorasi , Westfield Centrepoint minorasi , Big Poke , Centrepoint minorasi yoki shunchaki Centrepoint deb nomlangan .
Sidney minorasi Butunjahon buyuk minoralar federatsiyasining a'zosi.
Minora , Pitt va Kastlerag ko'chalari o'rtasida, Market ko'chasida joylashgan Sidneyning markaziy biznes tumanidan (CBD) 309 m (1,014 fut) balandlikda joylashgan. Bunga Pitt Street Mall , Market Street yoki Castlereagh ko'chalaridan kirish mumkin va Westfield Sidney (sobiq Centrepoint) savdo markazi ustida joylashgan. Minora jamoatchilik uchun ochiq va shaharning eng taniqli sayyohlik joylaridan biri bo'lib, u shahar bo'ylab va unga tutash shahar atrofi bo'ylab bir qator diqqat markazlaridan ko'rinadi. Oklendning Sky Tower balandroq, ammo Sidney minorasining asosiy kuzatuv maydonchasi Oklendning Sky Tower minorasidagi kuzatish maydonchasidan qariyb 30 m (98 fut) balanddir''',
    "twelve":
        '''Blekpul minorasi - Angliya , Lancashire , Blekpul shahridagi turistik diqqatga sazovor joy , u 1894 yil 14-mayda jamoatchilik uchun ochilgan. U ochilganida, Blekpul minorasi Britaniya imperiyasida eng baland inshoot bo'lgan inshoot edi . Parijdagi Eyfel minorasidan ilhomlanib , uning balandligi 518 fut (158 metr) va dunyodagi eng baland 125-mustaqil minoradir. Blackpool minorasi ham minorasi binolar uchun umumiy nomi, belgilangan edi qasr, minorasi tsirk, minorasi Balo Zali, va tom bog'lar o'z ichiga olgan bir qizil g'ishtdan uch qavatli blokda, bir o'yin-kulgi murakkab sanab sinf I 1973 yildagi bino . Minora 2019 yil may oyida 125 yilligini nishonladi''',
    "thirteen":
        '''1969 yilda taxminan 2,5 million AQSh dollari miqdorida qurilgan Namsam minorasi 1980 yilda jamoatchilikka ochilgan. Seul minorasi 1971 yil 3 dekabrda qurilgan bo'lib, Jangjongryul me'morlari tomonidan loyihalashtirilgan, ammo o'sha paytda bino ichki qismi jihozlanmagan edi. 1975 yil 15-oktabrgacha boshqa inshootlarni olib kelish bilan bir qatorda rasadxonaning pastki qavati, muzeyi, ochiq zali, yodgorlik do'konining uchinchi qavati uchun 1975 yil avgustgacha vaqt kerak bo'ldi. O'shandan beri bu minora Seulning diqqatga sazovor joyiga aylandi. Minora balandligi 236,7 m (777 fut) dan dengiz sathidan 479,7 m (1,574 fut) gacha. 2005 yilda Seul minorasi nomi N Seul minorasi deb o'zgartirilgan, "N" esa "yangi", "Namsan" va "tabiat" so'zlarini anglatadi. Minorani qayta qurish va qayta qurish uchun taxminan 15 milliard KRW mablag sarflandi.''',
    "fourteen":
        '''Zizkov televideniya minorasi ( Chexiya : Žižkovský vysílač ) noyob hisoblanadi uzatuvchi barpo minora Praga me'mor Václav Aulický va tarkibiy muhandis Jiří Kozak tomonidan ishlab chiqilgan 1985 va 1992 o'rtasidagi, u o'z lavozimidan shahar an'anaviy silueti yuqorida yuqori turadi Zijkov tumanidagi tepalikning tepasida, u o'z nomini oldi. Minora yuqori texnologiyali me'morchilik namunasidir.
Minora balandligi 216 metr (709 fut), rasadxonaning balandligi 93 m, mehmonxona xonasining balandligi 70 m, restoranlarning balandligi 66 m, 180 kishiga mo'ljallangan. Uchta lift 4 m / s tezlikda yo'lovchilarni tashiydi''',
    "fifteen":
        '''Olimpiya stadioni ( Frantsiya : Stade olympique ) bir emas bir nechta maqsadi stadioni ham Monreal, Kanada joylashgan, Olimpiya bog'ida yilda Hochelaga-Maisonneuve shahar tumani. Sifatida o'rta-1970 yilda qurilgan asosiy makon uchun 1976 Yozgi Olimpiya o'yinlarida , u "Katta Ey", ikkala uning nomiga va mos yozuvlar ataladi donut Stadionning tomi doimiy komponent -shape. Monreal minorasi stadioni yonida turgan minora, dunyodagi eng baland moyil minora bo'lib, uning burchagi 45 darajaga ko'tarilgan. Shuningdek, stadion va umuman 1976 yilgi Olimpiada o'yinlarining astronomik xarajatlariga ishora qilish uchun "Katta qarz" deb nomlangan.
Stadion Kanadadagi eng katta joy. Olimpiadadan so'ng sun'iy maysazor o'rnatildi va u Monrealning professional beysbol va futbol jamoalarining uyiga aylandi . Monreal Alouettes ning CFL ularning oldingi uyiga qaytdi Molson stadionida yilda 1998 muntazam mavsumda o'yinlariga, lekin playoff va Olimpiya stadioni foydalanishga davom Grey chempionati ular qaytgach 2014 yilgacha o'yinlari Molson stadionida o'z o'yinlarini barcha uchun. Quyidagi 2004 beysbol mavsumda, Expos bo'lishga Vashingtonda, ko'chibWashington Nationals . Ayni paytda stadion 56.040 kishilik doimiy sig'inadigan maxsus tadbirlar (masalan, kontsertlar, savdo shoulari) uchun ko'p maqsadli bino bo'lib xizmat qilmoqda.''',
    "sixteen":
        '''Toshkent televideniya minorasi ( o'zbek : Toshkent Teleminorasi ) joylashgan, bir 375 metr balandlikdagi (1.230 ft) minora bo'lgan Toshkent , O'zbekiston va dunyoda 12 eng baland minora bo'ladi. Qurilish 1978 yilda boshlangan va 6 yildan so'ng, 1985 yil 15 yanvarda ishga tushirilgan. 1985 yildan 1991 yilgacha dunyodagi eng baland to'rtinchi minora bo'lgan. Bundan tashqari, Toshkent minorasi yoki O'zbekiston tele-minorasini qurish to'g'risida qaror 1971 yilda qabul qilingan. 1 sentyabr kuni televizion va radio signallarni butun O'zbekistonga tarqatish maqsadida. U vertikal konsol konstruktsiyasida va po'latdan yasalgan. Uning me'moriy dizayni Terxiev, Tsarucov & Semashko firmasining mahsulotidir.
Minora erdan 97 metr balandlikda (318 fut) balandlikda joylashgan kuzatuv maydonchasiga ega. Bu Qozog'istonning Ekibastuz shahridagi Ekibastuz GRES-2 elektr stantsiyasidan keyin Markaziy Osiyodagi eng baland inshoot . Shuningdek, u Butunjahon Buyuk minoralar federatsiyasiga tegishli .
Minoraning asosiy maqsadi - radio va televidenie . Signal Toshkent viloyatining eng chekka nuqtalariga va Qozog'istonning ba'zi janubiy viloyatlariga etib boradi . Minora, shuningdek, davlat idoralari va tashkilotlar o'rtasidagi aloqa uchun ishlatiladi. Minora, shuningdek, murakkab gidrometeorologik stantsiya sifatida xizmat qiladi.''',
    "seventeen":
        '''Empire State Building bir 102-hikoya  Art Deco bilan osmono'par Nafasni yilda Nyu-York Siti , Amerika Qo'shma Shtatlari. Uning dizayni Shreve, Lamb & Harmon tomonidan ishlab chiqarilgan va 1930 yildan 1931 yilgacha qurilgan. Uning nomi Nyu-York shtatining laqabi bo'lgan " Empire State " dan olingan . Bino tomining balandligi 1250 fut (380 m) va antennasini hisobga olgan holda jami 1454 fut (443,2 m) balandlikda. Empire State Building 1970 yilda Jahon Savdo Markazi qurilgunga qadar dunyodagi eng baland bino bo'lib turibdi ; Quyidagi 2001 yilda uning ag'darilishiga, Empire State Building 2020 2012 As qadar yana shahar baland osmono'par edi , bino Nyu-York shahrida yettinchi-baland bino , Amerika Qo'shma Shtatlarida to'qqizinchi-baland yakunlandi osmono'par , 48-baland dunyoda , va Amerikadagi beshinchi eng baland mustaqil qurilish .
G'arbiy 33 va 34-ko'chalar orasidagi Beshinchi avenyuning g'arbiy qismida joylashgan Midtown janubidagi Empire State Building binosi 1893 yilda Waldorf-Astoria mehmonxonasi sifatida ishlab chiqilgan . 1929 yilda Empire State Inc saytni sotib oldi va u erda osmono'par bino qurish rejalarini ishlab chiqdi. Empire State Buildingning dizayni dunyodagi eng baland bino bo'lishiga qadar o'n besh marta o'zgartirildi. Qurilish 1930 yil 17 martda boshlangan va bino o'n uch yarim oydan so'ng 1931 yil 1 mayda ochilgan. Buyuk depressiya va Ikkinchi Jahon urushi tufayli bino qurilishi bilan bog'liq bo'lgan taniqli reklama bo'lishiga qaramay., uning egalari 1950-yillarning boshlariga qadar foyda ko'rmadilar.''',
    "eighteen":
        '''Ostankino minorasi ( rus : Останкинская телебашня , Ostankinskaya telebashnya ) bir bo'lib televizor va radio minora ham Moskva , Rossiya unitar korxonasi Moskva filiali qarashli, Rossiya teleradioeshittirish tarmog'i . 540,1 metr (1772 fut) balandlikda turgan Ostankino Nikolay Nikitin tomonidan ishlab chiqilgan . Bu ayni paytda eng baland erkin doimiy tarkibi bo'lgan Evropa va dunyoda 11-baland. 1967 va 1974 yillar orasida u dunyodagi eng baland bo'yli edi. Minora balandligi 500 metrdan (1600 fut) oshgan birinchi mustaqil bino edi. Ostankino Oktyabr inqilobining 50 yilligi munosabati bilan qurilgan . Unga Moskvaning atrofidagi Ostankino tumani nomi berilgan .
Qurilish 1963 yilda boshlangan va 1967 yilda qurib bitkazilgan. Oldindan siqilgan betondan keng foydalanish natijasida oddiy va mustahkam tuzilishga erishildi . Bu Empire State Building- dan oshib, dunyodagi eng baland mustaqil binoga aylandi . U ushbu rekordni sakkiz yil davomida 1975 yilda Kanadadagi CN Tower tomonidan bosib o'tib, balandligidan 13 metr (43 fut) ga oshib ketgan. Ostankino minorasi Burj Xalifaga qadar yana 32 yil davomida dunyodagi eng baland mustaqil bino bo'lib qoldi. 2007 yilda balandligi bo'yicha ham undan, ham CN minorasidan ustun keldi. Ostankino minorasi 50 yildan beri Evropadagi eng baland inshoot bo'lib qolmoqda.
Antenna qo'shish orqali minoraning balandligini 561 metrgacha ko'tarish bo'yicha 1994 yildagi reja mablag 'etishmasligi sababli amalga oshirilmadi.''',
    "nineteen":
        '''Tyantszin Radio va televideniya minorasi bir 415.2 metr (1.362 ft) hisoblanadi minora ham Tianjin , Xitoy , birinchi navbatda, aloqa uchun ishlatiladi. Bu dunyodagi eng baland 8-mustaqil minoradir . U 1991 yilda 45 million dollar qiymatida qurilgan. Minora yuqoriga ko'tarilishning taxminan uchdan ikki qismi 253 kvadrat metr (2720 kvadrat metr) maydonni (asosan aloqa uskunalari uchun ishlatiladigan) kuzatuv podkosidir. U Butunjahon Buyuk minoralar federatsiyasining a'zosi .''',
    "twenty":
        '''CN Tower ( Frantsiya : Tour CN ) bir 553,3 m-yuqori (1,815.3 ft) hisoblanadi aniq aloqa va kuzatish minorasi joylashgan Downtown Toronto , Ontario , Kanada. [3] [8] Sobiq temir yo'l erlarida qurilgan , 1976 yilda qurib bitkazilgan. Uning "CN" nomi dastlab minorani qurgan temir yo'l kompaniyasi Kanada milliy kompaniyasiga tegishli edi. 1995 yilda kompaniya xususiylashtirilgunga qadar temir yo'lning asosiy bo'lmagan yuk temir yo'l aktivlarini ajratish to'g'risidagi qaroridan so'ng , u minorani Canada Lands Company kompaniyasiga topshirdi., ko'chmas mulkni rivojlantirish uchun mas'ul bo'lgan federal Crown korporatsiyasi .
CN Tower uchun rekord bo'lib dunyodagi eng baland erkin tik tuzilishi uni oshdi qachon 2007 yilgacha 32 yil davomida Burj Halifa va bo'ldi dunyodagi eng baland minora u oshdi qachon 2009 yilgacha Canton minorasi. Hozir u dunyodagi eng baland to'qqizinchi balandlik va G'arbiy yarim sharda quruqlikdagi eng baland mustaqil bino bo'lib qolmoqda . 1995 yilda CN Tower Amerika qurilish muhandislari jamiyati tomonidan dunyoning zamonaviy etti mo''jizalaridan biri deb e'lon qilindi . Shuningdek, u Butunjahon Buyuk minoralar federatsiyasiga tegishli.
Bu Toronto siluetining imzo belgisi va har yili ikki milliondan ortiq xalqaro mehmonlarni jalb qiladi. ''',
    "twentyone":
        '''Pekin Olimpiada minorasi ( Xitoy :北京奥林匹克塔; pinyin : Pekin Àolínpǐkè Tǎ ) Kehui Janubiy yo'li, bir qismi joylashgan Olimpiya Green yilda Chaoyang tumanida tashkil Pekin , Xitoy. Qurilish 2011 yil, 2008 yilgi Yozgi Olimpiya o'yinlaridan uch yil o'tgach boshlangan ; u 2014 yilda yakunlangan va 2015 yil 8 avgustda ochilgan. Bu qat'iyan kuzatuv uchun ishlatiladi; ofislar yoki kvartiralar uchun sharoit yo'q. Dizayn Xitoy firmasi, China Architecture Design & Research Group tomonidan ishlab chiqarilgan; a Shenzhenme'mor firmaning me'morlari uning ilgari mukofotlangan dizaynini plagiat qilgan deb da'vo qilishdi.
Balandligi 258 metr (846 fut) da, u keyin shahrida ikkinchi eng baland minora bo'ladi Markaziy Radio va TV minorasi va shahrida to'rtinchi eng baland imorat . Uning dizayni to'rtta kichik dumaloq qavatlar turli balandliklarda va kattaroq yuqori qavat ostida joylashgan bo'lib, Olimpiya halqalarini aks ettirishga mo'ljallangan . Umumiy dizayni o't pichoqlaridan ilhomlangan; ammo uni "ulkan mixlar" ga o'xshatishgan.''',
    "twentytwo":
        '''Chikago Spire bir bo'ldi osmono'par qisman bekor oldin 2007 va 2008 yillar orasida qurilgan Chikago loyiha. 400 N. Leyk Shore Drive- da joylashgan bo'lib , balandligi 2000 metr (610 m) 150 qavatli va G'arbiy yarimsharda eng baland bino bo'lgan bo'lar edi. Dastlab Fordham Spire sifatida 2005 yil iyul oyida taklif qilinganida, dizayn 116 ta hikoyadan iborat bo'lib, mehmonxona va kondominyumlarni o'z ichiga olgan va tepasida efirga uzatiladigan antenna ustuni o'rnatilgan. Bino mo'ljallangan va Ispaniya arxitektor-muhandis tomonidan amalga oshirilayotgan edi Santiago Calatrava va Chikago Tuzuvchi Kristofer T. Carley ning Fordham kompaniyasi . 2006 yil 16 martdaChikago rejasi komissiyasi binoning dastlabki loyihasini bir ovozdan ma'qulladi. 2014 yil 4-noyabrda sud qarori bilan dastlabki rivojlanish rejasi va to'qqiz yillik loyiha bo'yicha kengaytirilgan sud jarayoni tugadi. Ishlab chiqaruvchi Garrett Kelleher loyihaning eng yirik kreditori Related Midwest-ga mulk joylashgan joyni imzoladi, u Spire-ni qurmasligini e'lon qildi va sayt uchun rejalarini e'lon qildi .''',
    "twentythree":
        '''Oriental Pearl Radio va televideniya minorasi ( xitoy soddalashtirilgan :东方明珠塔; an'anaviy Xitoy :東方明珠塔; pinyin : Dongfang Míngzhūtǎ ; Shanghainese : Tonfon Mintsyta , rasmiy nomi:东方明珠广播电视塔) bir emas teleminorasi yilda Shanxay . Uning Lujiazui uchida , Pudong yangi hududida , Xuanpu daryosi bo'yida , Bundga qarshi joylashgan joyi ., uni mintaqadagi aniq belgi qiladi. Uning asosiy dizaynerlari Tszyan Xuan Chen, Lin Benlin va Chjan Syulin edi. Qurilish 1991 yilda boshlangan va minora 1995 yilda qurib bitkazilgan.
468 m (1536 fut) balandlikda, u 1994-2007 yillarda Shanxay Jahon Moliya Markazi tomonidan oshib ketgan Xitoydagi eng baland inshoot edi . Bu Xitoy milliy turizm ma'muriyati tomonidan AAAAA manzarali zonasi sifatida tasniflanadi. Minora tunda turli xil LED qatorlarida yorqin yoritilgan . 2007 yil 7 iyulda Oriental Pearl Tower-da Xitoyning Live Earth kontserti bo'lib o'tdi .
Minora katta va kichik 11 sferadan iborat. Minora uzunligi bo'ylab ikkita eng katta sharning pastki qismi 50 m (164 fut), yuqori qismi 45 m (148 fut) ga teng. Ular har biri 9 m (30 fut) diametrli uchta ustun bilan bog'langan. Eng baland shar diametri 14 m (46 fut) ga teng.
Butun minorani er ostidan boshlanadigan uchta ulkan ustunlar ko'tarib turadi .''',
    "twentyfour":
        '''Kuala Lumpur minorasi ( KL Tower ; Malay : Menara Kuala Lumpur ) aloqa joylashgan minora bo'ladi Kuala Lumpur , Malayziya . Uning qurilishi 1995 yil 1 martda yakunlandi. Antenna balandligini 421 metrgacha (1381 fut) ko'taradi va dunyodagi eng baland 7-mustaqil minoradir . Podkaning tomi 335 metrni tashkil etadi (1099 fut). Quyidagi minoraning qolgan qismida zinapoya va yuqori maydonga etib boruvchi lift mavjud bo'lib, unda aylanma restoran ham mavjud bo'lib, u ovqatlanuvchilarga shaharning panoramali ko'rinishini beradi.
Musobaqalar har yili o'tkaziladi, unda ishtirokchilar zinapoyadan yuqoriga ko'tarilishadi. Minora, shuningdek bajaradi Islom falak rasadxonasini nazari boshlanadigan yarim oy oyni kuzatish uchun musulmon oy bo'yicha Ramazon , Syawal va Zulhijjah nishonlash uchun, oy ro'za yil Ramazon , Hari messi Aidilfitri va Aidiladha . Minora Kuala-Lumpurda jamoatchilik uchun ochiq bo'lgan eng yuqori nuqtai nazardir.''',
  },
  "US": {
    "one":
        '''Tokyo Tower (東京タワー, Tōkyō tawā, officially called 日本電波塔 Nippon denpatō "Japan Radio Tower") is a communications and observation tower in the Shiba-koen district of Minato, Tokyo, Japan. 
At 332.9 meters (1,092 ft), it is the second-tallest structure in Japan. The structure is an Eiffel Tower-inspired lattice tower that is painted white and international orange to comply with air safety regulations.
Built in 1958, the tower's main sources of income are tourism and antenna leasing. Over 150 million people have visited the tower. FootTown, a four-story building directly under the tower, houses museums, restaurants, and shops. Departing from there, guests can visit two observation decks. 
The two-story Main Deck (formerly known as the Main Observatory) is at 150 meters (490 ft), while the smaller Top Deck (formerly known as the "Special Observatory") reaches a height of 249.6 meters (819 ft). The names were changed following renovation of the top deck in 2018''',
    "two": '''
Rialto Tower, Rialto Towers (Melbourne, Australia)
Construction: 1982 - 1986
Height: 270 meters
Architect: Gerard de Preu and Partners
Perrott lyon mathieson
The building was designed by the architectural firm Gerar de Rreu and Partners in cooperation with Perrott Lyon Mathieson. The construction of the building took place from 1982 to 1986. The official opening took place in October 1986. The name of the building has passed to it from the historical complex located next door.''',
    "three":
        '''The original total height of the tower was 365 metres (1,198 ft), but it rose to 368 metres (1,207 ft) after the installation of a new antenna in 1997.
The Fernsehturm is the fourth tallest free-standing structure in Europe, after Moscow's Ostankino Tower, the Kiev TV Tower and the Riga Radio and TV Tower. The sphere is a visitor platform and a revolving restaurant in the middle of the sphere. The visitor platform, also called panoramic floor, is at a height of about 203 metres (666 ft) above the ground and visibility can reach 42 kilometres (26 mi) on a clear day. The restaurant "Telecafé", which rotates once every 30 minutes, is a few metres above the visitors platform at 207 metres (679 ft).
When first constructed, it turned once per hour; the speed was later doubled following the tower's 1997 renovation.
Two lifts transports visitors to the sphere of the tower within 40 seconds. There is also a stairway with 986 steps''',
    "four":
        '''Torre de Collserola (Catalan pronunciation: [ˈtorə ðə kuʎsəˈɾɔlə]) is a uniquely designed tower located on the Tibidabo hill in the Serra de Collserola, in Barcelona, Catalonia, Spain. It was designed by the architect Sir Norman Foster and by the Spanish civil engineers Julio Martínez Calzón and Manuel Julià Vilardell. This emblematic tower was built in 1991 by the construction company Cubiertas y MZOV S.A. for the 1992 Summer Olympics. It features a pod for floor space like many towers but uses guy wires for lateral support like a mast. Mainly used as a TV and radio transmitter, this futuristic design provides the highest viewpoint over the city. The top antenna reaches 288.4 m (946 ft) and the top of the pod, which has thirteen floors, reaches 152 m (499 ft). The highest point of this tower is the highest place one could be in the city of Barcelona. The tenth floor of the pod is open to the public.''',
    "five":
        '''The Sky Tower is a telecommunications and observation tower in Auckland, New Zealand. Located at the corner of Victoria and Federal Streets within the city's CBD, it is 328 metres (1,076 ft) tall, as measured from ground level to the top of the mast, making it the tallest freestanding structure in the Southern Hemisphere and the 27th tallest tower in the world. It has become an iconic landmark in Auckland's skyline due to its height and unique design.
The tower is part of the SkyCity Auckland casino complex, originally built in 1994–1997 for Harrah's Entertainment. Several upper levels are accessible to the public, attracting an average of 1,150 visitors per day (over 415,000 per year)''',
    "six":
        '''Harbour Centre is a skyscraper in the central business district of Downtown Vancouver, British Columbia, Canada which opened in 1977. The "Lookout" tower atop the office building makes it one of the tallest structures in Vancouver and a prominent landmark on the city's skyline. With its 360-degree viewing deck, it also serves as a tourist attraction with the Top of Vancouver Revolving Restaurant, offering a physically unobstructed view of the city.
Harbour Centre is located at 555 West Hastings Street in Downtown Vancouver. It is steps away from Waterfront Station, a major multi-modal transit hub which serves as the Downtown Vancouver terminal for various TransLink operations including SeaBus, West Coast Express, SkyTrain, Canada Line and buses. Simon Fraser University operates its downtown Harbour Centre campus in the adjoining Spencer building and houses the Center for Dialogue and Canadas World.''',
    "seven":
        '''Telstra Tower (also known as Black Mountain Tower and formerly Telecom Tower) is a telecommunications tower and lookout that is situated above the summit of Black Mountain in Australia's capital city of Canberra. It is named after Australia's largest telecommunications company, Telstra Corporation, which owns and operates the tower. Rising 195.2 metres (640 ft) above the mountain summit, it is a landmark in Canberra and offers panoramic views of the city and its surrounding countryside from an indoor observation deck and two outdoor viewing platforms.''',
    "eight":
        '''The Torre Latinoamericana (English: Latin American Tower) is a skyscraper in downtown Mexico City, situated in the historic city center. Its central location, height (166 m (545 ft)), and history make it one of the city's most important landmarks. It is widely recognized internationally as an engineering and architectural landmark since it was the world's first major skyscraper successfully built on highly active seismic zone. The skyscraper notably withstood the 8.1 magnitude 1985 Mexico City earthquake without damage, whereas several other structures in the downtown area were damaged.
The Torre Latinoamericana was Mexico's tallest completed building for almost 27 years, from its opening in 1956 until 1982 when the 214 m (702 ft) tall Torre Ejecutiva Pemex was completed. Although the structure of the Hotel de México (now known as the WTC Mexico City) had already surpassed it a decade earlier, it wouldn't be finished until 1994''',
    "nine":
        '''The Donauturm (English: Danube Tower) is a tower in Vienna, the tallest structure in Austria at 252 metres (827 ft), and is the 59th tallest tower in the world. Opening in April 1964, the tower is located near the north bank of the Danube River in the district of Donaustadt. The hills Leopoldsberg and Kahlenberg are visible in the background.
The Donauturm was constructed during 1962–1964, as designed by architect Hannes Lintl, in preparation for the Viennese International Horticultural Show 1964. The tower stands at 252 metres (827 ft) in height. Groundbreaking took place on 12 October 1962. After approximately 18 months of construction, under the supervision of Eberhard Födisch, the tower was officially opened on 16 April 1964 by Federal President Adolf Schärf.''',
    "ten":
        '''Euromast is an observation tower in Rotterdam, Netherlands, designed by Hugh Maaskant constructed between 1958 and 1960. It was specially built for the 1960 Floriade, and is a listed monument since 2010. The tower is a concrete structure with an internal diameter of 9 m (30 ft) and a wall thickness of 30 cm (12 in). For stability it is built on a concrete block of 1,900,000 kg (4,200,000 lb) so that the centre of gravity is below ground. It has a "crow's nest" observation platform 96 m (315 ft) above ground and a restaurant. Originally 101 m (331 ft) in height it was the tallest building in Rotterdam. It lost this position to the high-rise of Erasmus MC (113.5 m, 372 ft) which was completed in 1968, but regained it when the Space Tower was added to the top of the building in 1970, giving an additional 85 m (279 ft). Euromast is the highest building of the Netherlands, it is also a member of the World Federation of Great Towers. In 2008 and 2009, the tower hosted an extreme sports event which featured BASE jumping.''',
    "eleven":
        '''Sydney Tower is Sydney's tallest structure and the second tallest observation tower in the Southern Hemisphere. The name Sydney Tower has become common in daily usage; however, the tower has been known as the Sydney Tower Eye, AMP Tower, Flower Tower, Glower Tower, Westfield Centrepoint Tower, Big Poke, Centrepoint Tower or just Centrepoint.
The Sydney Tower is a member of the World Federation of Great Towers.
The tower stands 309 m (1,014 ft) above the Sydney central business district (CBD), located on Market Street, between Pitt and Castlereagh Streets. It is accessible from the Pitt Street Mall, Market Street or Castlereagh Street and sits above the Westfield Sydney (formerly Centrepoint) shopping centre. The tower is open to the public, and is one of the most prominent tourist attractions in the city, being visible from a number of vantage points throughout town and from adjoining suburbs. Auckland's Sky Tower is taller but Sydney Tower's main observation deck is almost 30 m (98 ft) higher than the observation deck on Auckland's Sky Tower.''',
    "twelve":
        '''Blackpool Tower is a tourist attraction in Blackpool, Lancashire, England, which was opened to the public on 14 May 1894. When it opened, Blackpool Tower was the tallest man made structure in the British Empire. Inspired by the Eiffel Tower in Paris, it is 518 feet (158 metres) tall and is the 125th-tallest freestanding tower in the world. Blackpool Tower is also the common name for the Tower Buildings, an entertainment complex in a red-brick three-storey block that comprises the tower, Tower Circus, the Tower Ballroom, and roof gardens, which was designated a Grade I listed building in 1973. The tower celebrated its 125th anniversary in May 2019''',
    "thirteen":
        '''Built in 1969 at a cost of approximately US\$2.5 million, Namsam tower was opened to the public in 1980. Seoul Tower was completed on December 3, 1971, designed by architects at Jangjongryul though at the time the facility interior was not furnished. It took until August 1975 for the third floor of the observatory deck, museum, open hall, souvenir shop, in addition to bring the other facilities to until October 15, 1980. Since then, the tower has been a landmark of Seoul. Tower elevation ranges from 236.7 m (777 ft) at the base to 479.7 m (1,574 ft) above sea level. Seoul Tower had its name changed to N Seoul Tower in 2005 whereas the "N" stands for 'new', 'Namsan', and 'nature.' Approximately 15 billion KRW was spent in renovating and remodeling the tower''',
    "fourteen":
        '''The Žižkov Television Tower (Czech: Žižkovský vysílač) is a unique transmitter tower built in Prague between 1985 and 1992. Designed by the architect Václav Aulický and the structural engineer Jiří Kozák, it stands high above the city's traditional skyline from its position on top of a hill in the district of Žižkov, from which it takes its name. The tower is an example of high-tech architecture.
The tower stands 216 metres (709 feet) high, altitude of the observatory is 93 m, the hotel room altitude is 70 m, restaurants altitude is 66 m, with a capacity of 180 people. Three elevators transport passengers at a speed of 4 m/s''',
    "fifteen":
        '''Olympic Stadium (French: Stade olympique) is a multi-purpose stadium in Montreal, Canada, located at Olympic Park in the Hochelaga-Maisonneuve district of the city. Built in the mid-1970s as the main venue for the 1976 Summer Olympics, it is nicknamed "The Big O", a reference to both its name and to the doughnut-shape of the permanent component of the stadium's roof. The tower standing next to the stadium, The Montreal Tower, is the tallest inclined tower in the world with an angle elevation of 45 degrees. It is also called "The Big Owe" to reference the astronomical cost of the stadium and the 1976 Olympics as a whole.
The stadium is the largest by seating capacity in Canada. After the Olympics, artificial turf was installed and it became the home of Montreal's professional baseball and football teams. The Montreal Alouettes of the CFL returned to their previous home of Molson Stadium in 1998 for regular season games, but continued to use Olympic Stadium for playoff and Grey Cup games until 2014 when they returned to Molson Stadium for all of their games. Following the 2004 baseball season, the Expos relocated to Washington, D.C., to become the Washington Nationals. The stadium currently serves as a multipurpose facility for special events (e.g. concerts, trade shows) with a permanent seating capacity of 56,040.''',
    "sixteen":
        '''The Tashkent Television Tower (Uzbek: Toshkent Teleminorasi) is a 375-metre-high (1,230 ft) tower, located in Tashkent, Uzbekistan and is the 12th tallest tower in the world. Construction started in 1978 and it began operation 6 years later, on 15 January 1985. It was the 4th tallest tower in the world from 1985 to 1991. Moreover, the decision of construction Tashkent Tower or TV-Tower of Uzbekistan was decided in 1971 in 1 September in order to spread the TV and radio signals to all over the Uzbekistan. It is of a vertical cantilever structure, and is constructed out of steel. Its architectural design is a product of the Terxiev, Tsarucov & Semashko firm.
The tower has an observation deck located 97 metres (318 ft) above the ground. It is second tallest structure in Central Asia after Ekibastuz GRES-2 Power Station in Ekibastuz, Kazakhstan. It also belongs to the World Federation of Great Towers.
The main purposes of the tower are radio and TV-transmission. The signal reaches the farthest points of Tashkent Province and some of the south regions of Kazakhstan. The tower is also used for communication between governmental departments, and organizations. The tower also serves as a complex hydrometeorological station.''',
    "seventeen":
        '''The Empire State Building is a 102-story Art Deco skyscraper in Midtown Manhattan in New York City, United States. It was designed by Shreve, Lamb & Harmon and built from 1930 to 1931. Its name is derived from "Empire State", the nickname of the state of New York. The building has a roof height of 1,250 feet (380 m) and stands a total of 1,454 feet (443.2 m) tall, including its antenna. The Empire State Building stood as the world's tallest building until the construction of the World Trade Center in 1970; following its collapse in 2001, the Empire State Building was again the city's tallest skyscraper until 2012. As of 2020, the building is the seventh-tallest building in New York City, the ninth-tallest completed skyscraper in the United States, the 48th-tallest in the world, and the fifth-tallest freestanding structure in the Americas.
The site of the Empire State Building, in Midtown South on the west side of Fifth Avenue between West 33rd and 34th Streets, was developed in 1893 as the Waldorf–Astoria Hotel. In 1929, Empire State Inc. acquired the site and devised plans for a skyscraper there. The design for the Empire State Building was changed fifteen times until it was ensured to be the world's tallest building. Construction started on March 17, 1930, and the building opened thirteen and a half months afterward on May 1, 1931. Despite favorable publicity related to the building's construction, because of the Great Depression and World War II, its owners did not make a profit until the early 1950s.
''',
    "eighteen":
        '''Ostankino Tower (Russian: Останкинская телебашня, Ostankinskaya telebashnya) is a television and radio tower in Moscow, Russia, owned by the Moscow branch of unitary enterprise Russian TV and Radio Broadcasting Network. Standing 540.1 metres (1,772 ft), Ostankino was designed by Nikolai Nikitin. It is currently the tallest free-standing structure in Europe and 11th tallest in the world. Between 1967 and 1974, it was the tallest in the world. The tower was the first free-standing structure to exceed 500 m (1,600 ft) in height. Ostankino was built to mark the 50th anniversary of the October Revolution. It is named after the surrounding Ostankino district of Moscow.
Construction began in 1963 and was completed in 1967. Extensive use of prestressed concrete resulted in a simple and sturdy structure. It surpassed the Empire State Building to become the tallest free-standing structure in the world. It held this record for eight years until it was overtaken by the CN Tower in Canada in 1975, which surpassed its height by 13 metres (43 ft). The Ostankino Tower remained the second-tallest free-standing structure in the world for another 32 years until the Burj Khalifa surpassed both it and the CN Tower in height in 2007. The Ostankino Tower has remained the tallest structure in Europe for over 50 years.
A 1994 plan to increase the tower's height to 561 metres (1,841 ft) by adding an antenna was not implemented for lack of funding.''',
    "nineteen":
        '''The Tianjin Radio and Television Tower is a 415.2-meter (1,362 ft)-tall tower in Tianjin, China used primarily for communication. It is the 8th tallest freestanding tower in the world. It was built in 1991 at a cost of \$45 million. Approximately two-thirds of the way up the tower is an observation pod with 253 square meters (2,720 sq ft) of floor space (used mostly for communication equipment). It is a member of the World Federation of Great Towers.''',
    "twenty":
        '''The CN Tower (French: Tour CN) is a 553.3 m-high (1,815.3 ft) concrete communications and observation tower located in Downtown Toronto, Ontario, Canada.[3][8] Built on the former Railway Lands, it was completed in 1976. Its name "CN" originally referred to Canadian National, the railway company that built the tower. Following the railway's decision to divest non-core freight railway assets prior to the company's privatization in 1995, it transferred the tower to the Canada Lands Company, a federal Crown corporation responsible for real estate development.
The CN Tower held the record for the world's tallest free-standing structure for 32 years until 2007 when it was surpassed by the Burj Khalifa, and was the world's tallest tower until 2009 when it was surpassed by the Canton Tower. It is now the ninth tallest free-standing structure in the world and remains the tallest free-standing structure on land in the Western Hemisphere. In 1995, the CN Tower was declared one of the modern Seven Wonders of the World by the American Society of Civil Engineers. It also belongs to the World Federation of Great Towers.
It is a signature icon of Toronto's skyline and attracts more than two million international visitors annually''',
    "twentyone":
        '''The Beijing Olympic Tower (Chinese: 北京奥林匹克塔; pinyin: Běijīng Àolínpǐkè Tǎ) is located on Kehui South Road, part of the Olympic Green in the Chaoyang District of Beijing, China. Construction began in 2011, three years after the 2008 Summer Olympics; it was completed in 2014, and opened on August 8, 2015. It is used strictly for observation; there is no provision for offices or apartments. The design was by a Chinese firm, China Architecture Design & Research Group; a Shenzhen architect alleged that the architects at the firm had plagiarized an award-winning earlier design of his.
At 258 metres (846 ft) in height it is the second tallest tower in the city after the Central Radio & TV Tower, and the fourth-tallest structure in the city. Its design, with four smaller circular floors at different heights and positions below a larger top floor, is meant to echo the Olympic rings. The overall design was inspired by blades of grass; however it has also been likened to "huge nails".''',
    "twentytwo":
        '''The Chicago Spire was a skyscraper project in Chicago that was partially built between 2007 and 2008 before being cancelled. Located at 400 N. Lake Shore Drive, it would have stood 2,000 feet (610 m) high with 150 floors and been the tallest building in the Western Hemisphere. When originally proposed as the Fordham Spire in July 2005, the design had 116 stories, included a hotel and condominiums, and was topped with a broadcast antenna mast. The building was designed and spearheaded by Spanish architect-engineer Santiago Calatrava and Chicago developer Christopher T. Carley of the Fordham Company. On March 16, 2006, the Chicago Plan Commission unanimously approved the initial design of the building. On November 4, 2014, a court ruling brought the original development plan and the extended litigation over the nine-year-old project to a close. Developer Garrett Kelleher signed over the property location to the project's biggest creditor, Related Midwest, who announced that they would not build the Spire and released their plans for the site.''',
    "twentythree":
        '''The Oriental Pearl Radio & Television Tower (simplified Chinese: 东方明珠塔; traditional Chinese: 東方明珠塔; pinyin: Dōngfāng Míngzhūtǎ; Shanghainese: Tonfon Mintsyta, official name: 东方明珠广播电视塔) is a TV tower in Shanghai. Its location at the tip of Lujiazui in the Pudong New Area by the side of Huangpu River, opposite The Bund, makes it a distinct landmark in the area. Its principal designers were Jiang Huan Chen, Lin Benlin, and Zhang Xiulin. Construction began in 1991, and the tower was completed in 1995.
At 468 m (1,536 feet) high, it was the tallest structure in China from 1994–2007, when it was surpassed by the Shanghai World Financial Center. It is classified as an AAAAA scenic area by the China National Tourism Administration. The tower is brightly lit in different LED sequences at night. On 7 July 2007, Oriental Pearl Tower was host to the Chinese Live Earth concert.
The tower features 11 spheres, big and small. The two largest spheres, along the length of the tower, have diameters of 50 m (164 ft) for the lower and 45 m (148 ft) for the upper. They are linked by three columns, each 9 m (30 ft) in diameter. The highest sphere is 14 m (46 ft) in diameter.
The entire tower is supported by three enormous columns that start underground.''',
    "twentyfour":
        '''The Kuala Lumpur Tower (KL Tower; Malay: Menara Kuala Lumpur) is a communications tower located in Kuala Lumpur, Malaysia. Its construction was completed on 1 March 1995. It features an antenna that increases its height to 421 metres (1,381 feet) and is the 7th tallest freestanding tower in the world. The roof of the pod is at 335 metres (1,099 feet). The rest of the tower below has a stairwell and an elevator to reach the upper area, which also contains a revolving restaurant, providing diners with a panoramic view of the city.
Races are held annually, where participants race up the stairs to the top. The tower also acts as the Islamic falak observatory to observe the crescent moon which marks the beginning of Muslim month of Ramadhan, Syawal, and Zulhijjah, to celebrate fasting month of Ramadhan, Hari Raya Aidilfitri and Aidiladha. The tower is the highest viewpoint in Kuala Lumpur that is open to the public.''',
  }
};
